# GetCompMasterSnaps

## Description
Gets the master snaps of a component in an object.

```pascal
FUNCTION GetCompMasterSnaps(
				object                : HANDLE;
				componentIndex        : INTEGER;
				VAR masterSnapOnLeft  : BOOLEAN;
				VAR masterSnapOnRight : BOOLEAN): BOOLEAN;
```

```python
def vs.GetCompMasterSnaps(object, componentIndex):
    return (BOOLEAN, masterSnapOnLeft, masterSnapOnRight)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|
|componentIndex|INTEGER|The index of the component.|
|masterSnapOnLeft|BOOLEAN|Returns whether or not the component has a master snap on its left.|
|masterSnapOnRight|BOOLEAN|Returns whether or not the component has a master snap on its right.|

## Examples
```pascal
resultOK := GetCompMasterSnaps(object, 1, TRUE, FALSE);
```
```python
import vs

# Gets the master snaps of a component in an object.
object = vs.FSActLayer()  # handle to the first selected object on the active layer
componentIndex = 1

ok, masterSnapOnLeft, masterSnapOnRight = vs.GetCompMasterSnaps(object, componentIndex)
vs.Message('GetCompMasterSnaps returned: ' + str((ok, masterSnapOnLeft, masterSnapOnRight)))
```

## See Also
VS Functions:
SetCompMasterSnaps

## Version
Availability: from Vectorworks 2017

## Category
* Objects - Architectural